[
    {
      "id":"pablodigtallvar",
      "title":"På blodigt allvar",
      "what":"Hemsida",
      "info": "På blodigt allvar jobbar för att personer som lider av kraftig mensvärk ska kunna delta i samhället på lika villkor. På webbplatsen kan besökare lära sig om mensvärk, med texter och filmer från experter, kändisar och ungdomar.",
      "content": [
        {
          "headline": "Paragraphs för varierat innehåll",
          "paragraph": "Organisationen bakom projektet ställde höga krav på ett varierat innehåll, där långa texten skulle göras visuellt tilltalande och tillgängliga för den unga målgruppen. Paragraphs i Drupal 8 valdes som verktyg för detta, vilket gav redaktörerna stor frihet att pussla ihop artiklar bestående av ett stort antal komponenter, utan att göra det onödigt krångligt och samtidigt behålla ett enhetligt utseende."
        },
        {
          "headline": "Modul för avancerad listning",
          "paragraph": "På blodigt allvar använder sig mycket av videos - media entities i Drupal. Ett krav var därför att videos och artiklar behövde listas om vartannat på kategorisidorna. Eftersom Drupals gränssnitt för Views inte klarar skapa vyer med blandade entity typer, utvecklades en egen modul för jobbet. Modulen pluggar in i Views query och skapar lista och filtreringar för att blanda node och media entities."
        }
      ],
      "link": {
        "url": "https://pablodigtallvar.se",
        "name": "pablodigtallvar.se"
      },
      "listimg": {
        "url": "pba_list.jpg",
        "alt": "Bild från pablodigtallvar.se"
      },
      "date": "Sep 2018",
      "tags": [ "Drupal" ],
      "extendedTags": "Drupal 8, Php, MySQL",
      "designer": {
        "url": "http://claespettersson.se",
        "name": "claespettersson.se"
      },
      "image": {
        "url": "pba.png",
        "alt": "Bild från pablodigtallvar.se"
      }
    },
    {
      "id":"mensvarkstestet",
      "title": "Mensvärkstestet",
      "what":"Webbapp",
      "info": "Hur känns din mensvärk? Mensvärkstestet hjälper besökare att sätta ord på var de själva ligger på en smärtskala, och ger skräddarsydda tips på vad de kan göra för att må bättre. Lanseringsveckan gjorde över 10.000 personer testet!",
      "content": [
        {
          "headline": "Interaktivt quiz",
          "paragraph": "Mensvärkstestet består av ett SPA ('Single page application') byggt med React.js/Redux, där de olika frågorna visas en i taget. Olika typer av frågor - enkelval, flerval, slider och ja/nej påståenden varvas. Beroende på hur en svarar kan en få ett par extra frågor. I slutet visas ens resultat och en sammanfattning av hur mens påverkar ens liv på tre olika områden (socialt, mentalt och fysiskt)."
        },
        {
          "headline": "Backend med Drupal 8",
          "paragraph" : "Quizet körs helt i webbläsaren, men ett backend i Drupal 8 finns för att spara inskickade svar anonymt. Svaren skickas via Drupals REST Api, sparas som noder och kan enkelt användas för statistik. Den som vill kan även få sina svar mailade till sig, även detta går via Drupals mail funktionalitet."
        }
      ],
      "link": {
        "url": "https://test.pablodigtallvar.se",
        "name": "test.pablodigtallvar.se"
      },
      "listimg": {
        "url": "mensvarkstestet_list.jpg",
        "alt": "Bild från test.pablodigtallvar.se"
      },
      "date": "Sep 2018",
      "tags": ["React", "Drupal"],
      "extendedTags": "React, Redux, Drupal 8",
      "image": {
        "url": "mensvarkstestet.png",
        "alt": "Bild från test.pablodigtallvar.se"
      }
    },
    {
      "id":"nagotharhant",
      "title": "Något har hänt",
      "what":"Webbapp",
      "info": "Projekt om sexuellt våld, för personer med intellektuella funktionsvariationer. Förutom tillgänglig, lättläst fakta innehåller webbplatsen ett Välj-ditt-eget-äventyr-spel",
      "content": [
        {
          "headline": "Under utveckling",
          "paragraph": "Detta projekt är under utveckling, och lanseras i maj 2019. Sajten byggs i Wordpress, och använder en mängd egna Gutenberg-block för att visa innehåll varierat och snyggt, men samtidigt enkelt för redaktörerna att underhålla."
        },
        {
          "headline": "Välj ditt eget äventyr",
          "paragraph": "Webbplatsen kommer innehålla ett interaktivt spel, där besökaren bestämmer hur karaktärerna agerar. Spelet byggs med React.js som frontend, och hämtar data från Wordpress med dess RESTful Api."
        }
      ],
      "listimg": {
        "url": "newcomersyouth_list.jpg",
        "alt": "Skärmdump av startsidan för nagotharahant.se"
      },
      "date": "Pågående",
      "tags": ["React", "Wordpress"],
      "extendedTags": "React, Redux, Wordpress, PHP, MySQL",
      "image": {
        "url": "mensvarkstest.png",
        "alt": "Image alt"
      }
    },
    {
      "id": "socialaspel",
      "title": "Sociala spel",
      "what":"Webbapp",
      "info": "Alla dina sociala favortspel samlade på ett ställe. Alltid tillgängligt, alltid gratis, alltid roligt!",
      "content": [
        {
          "headline": "",
          "paragraph": "Samling med sociala spel där webbappen utgör ett hjälpmedel för att spela tillsammans. Vissa spel används en skärm, som skickas runt bland spelarna. Andra spel har alla varsin skärm och får olika information."
        },
        {
          "headline": "Med andra ord",
          "paragraph": "Ordlista med ord som slumpas. En kan välja hur lång tid varje omgång är, och om en vill köra med förbjudna ord eller inte."
        },
        {
          "headline": "Fake artist",
          "paragraph": "Alla ritar tillsammans, men en av er vet inte vad ni ritar. Lyckas ni avslöja vem som är the fake artist? En spelare startar ett spel och bjuder in de övriga med en kod. När spelet startas slumpas ett ord, en kategori och en av er utses till fake artist. Byggd med hjälp av WebSockets för att skicka uppdateringar mellan spelare."
        }
      ],
      "github": {
        "url": "https://github.com/kinaya/socialgames",
        "name": "github.com/kinaya/socialgames"
      },
      "link": {
        "url": "https://socialgamesapp.herokuapp.com",
        "name": "socialgamesapp.herokuapp.com"
      },
      "listimg": {
        "url": "socialgames_list.jpg",
        "alt": "Bild från webbappen social games"
      },
      "date": "Jan 2019",
      "tags": ["Node.js", "React"],
      "extendedTags": "Node.js, Express, MongoDb, React/Redux, Websockets",
      "image": {
        "url": "socialgames.png",
        "alt": "Skärmdump från webbappen social games"
      }
    },
    {
      "id":"patalomsex",
      "title":"På tal om 6",
      "what":"Hemsida",
      "info": "Det är viktigt att kunna snacka om känslor, lust, jämställdhet och sex! Det är utgångspunkten för På tal om 6 som är ett modernt normkritiskt sexualundervisningsmaterial för högstadiet och gymnasiet.",
      "content": [
        {
          "headline": "Struktur för omfattande material",
          "paragraph": "Projektets omfattande material består av 29 filmer med tillhörande övningar. Övningarna kan vara relevanta för flera filmer, men alla filmer har olika övningar för Högstadiet och Gymnasiet. Allt kategoriseras dessutom efter skolämne, och till det kommer utdrag ur läroplanen som är relevant för den aktuella filmen, skolämnet och övningen. Kort sagt fanns behov av att flexibelt kunna lista innehållet, och Drupal 7 valdes tack vare de de stora möjligheterna med Views."
        }
      ],
      "link": {
        "url": "https://patalomsex.se",
        "name": "patalomsex.se"
      },
      "listimg": {
        "url": "patalom6_list.jpg",
        "alt": "Skärmdump av startsidan för patalomsex.se"
      },
      "date": "Maj 2016",
      "tags": [ "Drupal" ],
      "extendedTags": "Drupal 7, Php, MySQL",
      "image": {
        "url": "patalom6.png",
        "alt": "Image alt"
      }
    },
    {
      "id":"filmregionsydost",
      "title":"Filmregion Sydost",
      "what":"Hemsida",
      "info": "Filmregion Sydost hjälper filmare och filmälskare i Växjöregionen att skapa film och filmkultur. Webbplatsen samlar material för de olika målgrupperna och innehåller plattformen för en årlig filmfestival.",
      "content": [
        {
          "headline": "",
          "paragraph": "Webbplatsens innehåll struktureras genom ingångar för de tre mångrupperna: filmare, pedagoger och arrangörer. Drupals views används för att filtrera fram relevant material beroende på ingång. Filmregion Sydost jobbar med film, och naturligtvis är det lätt och smidigt att visa film på webbplatsen. Drupals Media modul gör att videos lätt hämtas från YouTube eller Vimeo och visas i blogginlägg och på sidor. I bloggen finns förutom filmer av alla dess slag inspiration, guider och mycket mer. På webbplatsen finns ett flertal fomulär byggda på Webforms, bland annat bokningsformulär för att låna utrustning."
        },
        {
          "headline": "Filmfestivalen TellUs",
          "paragraph": "Inom hemsidan ryms plattformen för den årliga filmfestivalen TellUs. Här kan filmskapare ladda upp sina egna filmer för att vara med och tävla. Besökare röstar sedan fram vinnarna i tre olika kategorier. Filmerna publicerar de tävlande på YouTube eller Vimeo, varpå de hämtas till Drupal med Media modulen. Röstningen är byggd på Entityforms och använder Drupals Session Api för att se till så det inte går att rösta mer än en gång."
        }
      ],
      "link": {
        "url": "https://filmregionsydost.se",
        "name": "filmregionsydost.se"
      },
      "listimg": {
        "url": "filmregionsydost_list.jpg",
        "alt": "Skärmdump av startsidan för filmregionsydost.se"
      },
      "date": "Maj 2016",
      "tags": [ "Drupal" ],
      "extendedTags": "Drupal 7, Php, MySQL",
      "image": {
        "url": "filmregionsydost.png",
        "alt": "Skärmdump av startsidan för filmregionsydost.se"
      }
    },
    {
      "id": "newcomersyouth",
      "title": "Newcomers Youth",
      "what":"Hemsida",
      "info": "Projekt inom RFSL som arbetar för unga nyanlända hbtq-personers rättigheter",
      "content": [
        {
          "headline": "",
          "paragraph": ""
        }
      ],
      "listimg": {
        "url": "newcomersyouth_list.jpg",
        "alt": "Skärmdump av startsidan för newcomersyouth.se"
      },
      "date": "Mars 2017",
      "tags": [ "Wordpress" ],
      "extendedTags": "Wordpress, Php, MariaDB",
      "image": {
        "url": "newcomersyouth.png",
        "alt": "Skärmdump av startsidan för newcomersyouth.se"
      }
    },
    {
      "id":"fridhadvokatbyra",
      "title":"Fridh Advokatbyrå",
      "what":"Hemsida",
      "info": "Advokatbyrå specialiserad på migrationsrätt. För en rättssäker, inkluderande och djärv humanjuridik.",
      "content": [
        {
          "headline": "",
          "paragraph": "Lättanvänd och stilren webbplats, som finns tillgänglig på fyra olika språk. Byggd med Drupal 7, vilket gör det enkelt att redigera materialet som enskilda sidor, men med hjälp av Views visa det för besökare i sektioner på en och samma sida."
        }
      ],
      "link": {
        "url": "https://fridhadvokatbyra.se",
        "name": "fridhadvokatbyra.se"
      },
      "listimg": {
        "url": "fridhadvokatbyra_list.jpg",
        "alt": "Liten bild från fridhadvokatbyra.se"
      },
      "date": "Mars 2016",
      "tags": ["Drupal"],
      "extendedTags": "Drupal 7, Php, MySQL",
      "image": {
        "url": "fridhadvokatbyra.png",
        "alt": "Skärmdump av startsidan för fridhadvokatbyra.se"
      }
    },
    {
      "id":"lesbiskmakt",
      "title":"Lesbisk Makt",
      "what":"Hemsida",
      "info": "Lesbisk Makt finns för att skapa, sprida och bevara lesbisk kultur och historia i hela landet. Föreningen driver projekt och organiserar lesbiska frukostar och andra evenemang.",
      "content": [
        {
          "headline": "",
          "paragraph": "Webbplatsen består av en omfattande 'lesbisk guide till allt', sök- och filtrerbar enligt kategori, typ av innehåll och plats. Besökare kan lägga till egna artiklar eller händelser som, efter granskning, visas i guiden. Drupals Views utnyttjas för listningar enligt kategori, relaterat till den aktuella sidan, via geotaggning m.m."
        },
        {
          "headline": "Automatiska anmälningsformulär",
          "paragraph": "Med hjälp av Drupals Webform och Webform template, kan föreningens lokalgrupper enkelt koppla anmälningsformulär till sina evenemang. Detta utnyttjas t.ex för de populära lesbiska frukostarna över hela landet."
        },
        {
          "headline": "Facebook Api",
          "paragraph": "Med hjälp av modulen Feed och Feed import, är hemsidan konfigurerad för att automatiskt hämta händelser som gillas av Lesbisk makts sida på Facebook. Händelserna läggs in som noder i Drupal, och visas i kalendariet. Kalendariet är därför sällan tomt och behöver minimalt med underhåll."
        },
        {
          "headline": "Google Api",
          "paragraph": "Även Googles API används på webbplatsen. När en stad anges i en artikel eller händelse, hämtas geotaggning från google och koordinater, län, kommun m.m. sparas och gör att innehåll kan sorteras och sökas med denna data. Även de händelser som hämtas från Facebook körs genom Googles Api och geodata kompletteras."
        }
      ],
      "link": {
        "url": "https://lesbiskmakt.nu",
        "name": "lesbiskmakt.nu"
      },
      "listimg": {
        "url": "lesbiskmakt_list.png",
        "alt": "Liten bild från lesbiskmakt.nu"
      },
      "date": "Nov 2017",
      "tags": ["Drupal"],
      "extendedTags": "Drupal 7, Php, MySQL, Facebook Api, Google Api",
      "designer": {
        "url": "http://maryamfanni.se",
        "name": "mayramfanni.se"
      },
      "image": {
        "url": "lesbiskmakt.png",
        "alt": "Skärmdump från startsidan för lesbiskmakt.nu"
      }
    },
    {
      "id": "luleapride",
      "title": "Luleå Pride",
      "what":"Hemsida",
      "info": "Luleå Pride är en årlig folkfest i hjärtat av Luleå. Festival arrangeras av RFSL Luleå och norra Norrbottens län.",
      "content": [
        {
          "headline": "",
          "paragraph": "Inbjudande webbplats där pride-besökare hittar all information de behöver om festivalen och Luleå stad. Wordpress gör webbplatsen enkel att uppdatera för festivalens volontärer. Programmet är filtrerbart per dag, kategori och/eller plats, så det är enkelt att hitta det som en är intresserad av!"
        }
      ],
      "link": {
        "url": "https://luleapride.se",
        "name": "luleapride.se"
      },
      "listimg": {
        "url": "luleapride_list.jpg",
        "alt": "Liten bild från luleapride.se"
      },
      "date": "Juni 2016",
      "tags": ["Wordpress"],
      "extendedTags": "Wordpress, Php, MariaDB",
      "image": {
        "url": "luleapride.png",
        "alt": "Skärmdump av startsidan för luleapride.se"
      }
    },
    {
      "id": "kollektivbudget",
      "title": "Kollektivbudget",
      "what":"Webbapp",
      "info": "Plattform för kollektiv och andra som delar budget att hålla koll på ekonomin. Enkelt gränssnitt med avancerade funktioner.",
      "content": [
        {
          "headline": "",
          "paragraph": "Användare fyller enkelt i summa och datum för sina inköp, och webbappen för statistik, räknar ut hur mycket en handlat för per månad och talar om vem som är skyldig vem pengar! En kan ställa in en budget per månad, och om en vill ha påminnelse att fylla i sina utgifter."
        },
        {
          "headline": "Material UI",
          "paragraph": "Googles Material Design, implementerad via Material UI för React."
        },
        {
          "headline": "Authenticering via Google",
          "paragraph": "För authenticering används Google Auth, med hjälp av Passport för Node.js."
        }
      ],
      "github": {
        "url": "https://github.com/kinaya/kollektivBudget",
        "name": "github.com/kinaya/kollektivBudget"
      },
      "listimg": {
        "url": "kollektivbudget_list.jpg",
        "alt": "Liten bild från webbappen kollektivbudget"
      },
      "date": "Feb 2019",
      "tags": ["Node.js", "React"],
      "extendedTags": "Node.js, Express, MongoDb, React/Redux, Material UI, Google Api",
      "image": {
        "url": "kollektivbudget.png",
        "alt": "Skärmdump från webbappen kollektivbudget"
      }
    }
  ]
